OpenFOAM-10/tutorials/combustion/reactingFoam/RAS/DLR_A_LTS/constant/chemistryProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant";
    object      chemistryProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#includeEtc "caseDicts/solvers/chemistry/TDAC/chemistryPropertiesFlame.cfg"

chemistryType
{
    solver            ode;
}

chemistry       on;

initialChemicalTimeStep 1e-7;

odeCoeffs
{
    solver          seulex;
    absTol          1e-8;
    relTol          1e-1;
}

tabulation
{
    // Scale factors used in the definition of the ellipsoid of accuracy
    scaleFactor
    {
        Temperature  1000;
    }
}

#include "reactionsGRI"

// ************************************************************************* //
